[
  {
   "name": "MS Dhoni",
   "role": "Wicketkeeper batsman/Captain",
   "batstyle": "Right-handed",
   "about": "A legend of world cricket, MS Dhoni is the only international captain to win all three ICC global trophies – the World T20 in 2007, the Cricket World Cup (50-over) in 2011 and the Champions Trophy in 2013. His record as all-time skipper of the Chennai Super Kings in IPL is equally stunning – four crowns, nine finals, playoffs in every season except one. All this, apart from leading the team to two Champions League T20 trophies in 2010 and 2014. The wicketkeeper-batsman had a stellar international career from 2004 to 2019, where he amassed more than 17000 runs across three formats. It included 10773 runs in ODIs, where he averaged in excess of 50. The Super Kings captain has played 220 IPL matches, scoring 4746 runs including 23 half-centuries. ",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/1.png",
   "born": " 07 July 1981",
   "matches": 220,
   "runs": 4746,
   "wickets": 0,
   "bowlingstyle": "Right-arm Medium",
   "hs": 84,
   "hw": 0,
   "id": "1"
  },
  {
   "name": "Suresh Raina",
   "role": "Batsman",
   "batstyle": "Left-handed",
   "about": "Suresh Raina is popularly referred to as Mr IPL for his consistency with the bat since the inaugural season. The southpaw is the first to achieve the 5,000-run mark in the competition. Not to forget his livewire presence on the field or his contribution as MS Dhoni’s deputy.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/14.png",
   "born": " 27 November 1986",
   "matches": 205,
   "runs": 5528,
   "wickets": 25,
   "bowlingstyle": "Right-arm Off-spin",
   "hs": 100,
   "hw": 2,
   "id": "2"
  },
  {
   "name": "Ravindra Jadeja",
   "role": "All-Rounder",
   "batstyle": "Left-hand bat",
   "about": "A steady left-arm spinner and reliable middle-order batsman, Ravindra Jadeja has developed into one of the best all-rounders in world cricket currently, across formats. His fielding skills deserve a special note. As Michael Hussey, the former Australian batsman and current fielding coach of Super Kings, said: \"Jadeja is a fantastic all-rounder and is worth 10 runs a game from his fielding alone\". Jadeja has been a part of the Super Kings side since 2012, and has played key roles in title victories in 2014 (CL T20), 2018 (IPL) and 2021 (IPL).",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/210/9.png",
   "born": "December 6th, 1988",
   "matches": "200",
   "runs": "2386",
   "wickets": "127",
   "bowlingstyle": " Slow left-arm orthodox",
   "hs": "62",
   "hw": "5",
   "id": "3"
  },
  {
   "name": "Dwayne Bravo",
   "role": "All-Rounder",
   "batstyle": " Right-hand bat",
   "about": "Dwayne Bravo has won the Purple Cap for most wickets on two occasions (2013 & 2015). However, numbers alone do not give the full picture of the Caribbean all-rounder’s contribution, given the high-impact nature of his play – big blows with the willow when it matters and a death overs specialist. Bravo relishes a challenge and comes out on top more often than not.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/25.png",
   "born": " October 7th, 1983",
   "matches": "151",
   "runs": "1537",
   "wickets": "167",
   "bowlingstyle": "Right-arm medium-fast",
   "hs": "70",
   "hw": "4",
   "id": "4"
  },
  {
   "name": "Moeen Ali",
   "role": "All-Rounder",
   "batstyle": "Left Hand Bat - Top",
   "about": "The elegant English all-rounder is known for his ability with both the bat and ball. A temperamentally strong and versatile batsman, Moeen made his presence felt in international cricket in just his second Test, with an unbeaten century against Sri Lanka. Moeen played 64 Tests for England scoring close to 3000 runs and picking up 195 wickets, before announcing his retirement from the format in 2021. Moeen has over 4000 runs in T20 cricket, in addition to picking up over 100 wickets. He joined the Super Kings ahead of the 2021 season and made an impact for the team immediately: Moeen amassed 357 runs and picked up 6 wickets to play a key role in the title win. He also has an ODI World Cup (2019) to his name.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/210/1735.png",
   "born": " June 18th, 1987",
   "matches": "34",
   "runs": "666",
   "wickets": "16",
   "bowlingstyle": " Right Arm - Off Spin",
   "hs": "66",
   "hw": "3",
   "id": "5"
  },
  {
   "name": " Ruturaj Gaikwad",
   "role": "Batsman",
   "batstyle": "Right-handed",
   "about": "Ruturaj Gaikwad became the youngest to win the Orange Cap when he scored 635 runs in IPL 2021, playing a crucial role in Super Kings' championship victory. Ruturaj also won the Emerging Player of the Year award for the season. Ruturaj made his debut for the Super Kings in 2020, where he showed glimpses of his talent with three successive half-centuries at the end of the season. Ruturaj made his International debut in July 2021 when India toured Sri Lanka and was also part of the three-match T20I series against New Zealand in November.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/5443.png",
   "born": "31 January 1997",
   "matches": "22",
   "runs": "839",
   "wickets": "0",
   "bowlingstyle": " Right-arm offbreak",
   "hs": "101",
   "hw": "0",
   "id": "6"
  },
  {
   "name": "Faf Du Plessis",
   "role": "Batsman",
   "batstyle": " Right-hand bat",
   "about": "Faf du Plessis’ biggest strength as a batsman is his ability to play according to situation. The tall, classy South African can, in fact, bat at any slot, is a fine crafter of an innings and a powerful striker of the ball. Strong on the front foot and possessing a sound defence, he is also a livewire on the field.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/24.png",
   "born": "July 13th, 1984",
   "matches": "100",
   "runs": "2935",
   "wickets": "0",
   "bowlingstyle": " Legbreak",
   "hs": "96",
   "hw": "0",
   "id": "7"
  },
  {
   "name": "Ambati Rayudu",
   "role": "Batsman",
   "batstyle": " Right-hand bat",
   "about": "Ambati Rayudu is a stylish middle-order batsman who has built a reputation of being a dangerous floater owing to his clean striking of the ball and cool approach. The 33-year-old was a revelation for CSK at the top of the order during the victorious 2018 campaign which led to his One-Day International comeback.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/100.png",
   "born": " September 23rd, 1985",
   "matches": "175",
   "runs": "3916",
   "wickets": "0",
   "bowlingstyle": "Right-arm offbreak",
   "hs": "100",
   "hw": "0",
   "id": "8"
  },
  {
   "name": "Sam Curran",
   "role": "All-rounder",
   "batstyle": "Left-handed",
   "about": "Sam Curran is an English bowling all-rounder who is a left-handed bat and left arm medium pacer. He had a very good Under 19 World Cup in 2016 going on to score 201 runs with the bat and 7 wickets with the ball. Made his international debut in 2018, Sam is seen as a long-term prospect for English cricket with his all-round ability. He also holds the record for becoming the youngest player to take an IPL hat-trick.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/2939.png",
   "born": " 03 June 1998",
   "matches": "32",
   "runs": "337",
   "wickets": "23",
   "bowlingstyle": " Left-arm -medium",
   "hs": "55",
   "hw": "4",
   "id": "9"
  },
  {
   "name": "Shardul Thakur",
   "role": "Bowler",
   "batstyle": "Right-handed",
   "about": "Aggressive and tireless, Shardul Thakur is a fast-medium bowler who faces a battle head-on, swinging the ball both ways and bending his back on unresponsive pitches. The Palghar-born has been Mumbai’s spearhead across formats and his consistent performances earned him India colours.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/1745.png",
   "born": " 16 October 1991",
   "matches": "61",
   "runs": "53",
   "wickets": "67",
   "bowlingstyle": "Right-arm Medium",
   "hs": "12",
   "hw": "3",
   "id": "10"
  },
  {
   "name": "Deepak Chahar",
   "role": "Bowler",
   "batstyle": "Right-handed",
   "about": "Medium-pacer Deepak Chahar had a breakthrough 2018 VIVO IPL season taking 10 wickets in 12 matches while bowling largely during Powerplay and was impressive in what was his first year with the Lions. The 26-year-old was subsequently rewarded with an India call-up in limited-overs cricket.",
   "image": "https://bcciplayerimages.s3.ap-south-1.amazonaws.com/playerheadshot/ipl/284/140.png",
   "born": " 07 August 1992",
   "matches": "63",
   "runs": "79",
   "wickets": "59",
   "bowlingstyle": "Right-arm Medium",
   "hs": "39",
   "hw": "4",
   "id": "11"
  }
 ]